STMicroelectronics/STM32CubeWBA/Projects/NUCLEO-WBA25CE/Applications/BLE/BLE_ESL_AP/STM32_WPAN/App/app_ble.c
          UTIL_SEQ_SetTask( 1U << CFG_TASK_CONN_SETUP, CFG_SEQ_PRIO_0);

          bleAppContext.deviceServerBdAddrType = p_conn_complete->Peer_Address_Type;
          memcpy(bleAppContext.a_deviceServerBdAddr, p_conn_complete->Peer_Address, BD_ADDR_SIZE);

          /* USER CODE END HCI_EVT_LE_CONN_COMPLETE */
          break; /* HCI_LE_CONNECTION_COMPLETE_SUBEVT_CODE */
        }
        case HCI_LE_ADVERTISING_REPORT_SUBEVT_CODE:
        {
          hci_le_advertising_report_event_rp0 *p_adv_report;
          p_adv_report = (hci_le_advertising_report_event_rp0 *) p_meta_evt->data;
          UNUSED(p_adv_report);

          rssi = HCI_LE_ADVERTISING_REPORT_RSSI(p_meta_evt->data);
          UNUSED(rssi);

          /* USER CODE BEGIN HCI_EVT_LE_ADVERTISING_REPORT */

          analyse_adv_report(p_adv_report->Advertising_Report[0].Length_Data, p_adv_report->Advertising_Report[0].Data,
                             p_adv_report->Advertising_Report[0].Address_Type, p_adv_report->Advertising_Report[0].Address);

          /* USER CODE END HCI_EVT_LE_ADVERTISING_REPORT */
          break; /* HCI_LE_ADVERTISING_REPORT_SUBEVT_CODE */
        }
        case HCI_LE_EXTENDED_ADVERTISING_REPORT_SUBEVT_CODE:
        {
          hci_le_extended_advertising_report_event_rp0 *p_ext_adv_report;
          p_ext_adv_report = (hci_le_extended_advertising_report_event_rp0 *) p_meta_evt->data;
          UNUSED(p_ext_adv_report);
          /* USER CODE BEGIN HCI_LE_EXTENDED_ADVERTISING_REPORT_SUBEVT_CODE */
          analyse_adv_report(p_ext_adv_report->Data_Length, p_ext_adv_report->Data,
                             p_ext_adv_report->Address_Type, p_ext_adv_report->Address);

          /* USER CODE END HCI_LE_EXTENDED_ADVERTISING_REPORT_SUBEVT_CODE */
          break; /* HCI_LE_EXTENDED_ADVERTISING_REPORT_SUBEVT_CODE */
        }
        /* USER CODE BEGIN SUBEVENT */
        case HCI_LE_ENHANCED_CONNECTION_COMPLETE_V2_SUBEVT_CODE:
        {
          uint32_t conn_interval_us = 0;
          hci_le_enhanced_connection_complete_v2_event_rp0 *p_enhanced_conn_complete;
          p_enhanced_conn_complete = (hci_le_enhanced_connection_complete_v2_event_rp0 *) p_meta_evt->data;
          conn_interval_us = p_enhanced_conn_complete->Conn_Interval * 1250;
          LOG_INFO_APP(">>== HCI_LE_ENHANCED_CONNECTION_COMPLETE_V2_SUBEVT_CODE - Connection handle: 0x%04X\n", p_enhanced_conn_complete->Connection_Handle);
          LOG_INFO_APP("     - Connection established with @:%02x:%02x:%02x:%02x:%02x:%02x\n",
                      p_enhanced_conn_complete->Peer_Address[5],
                      p_enhanced_conn_complete->Peer_Address[4],
                      p_enhanced_conn_complete->Peer_Address[3],
                      p_enhanced_conn_complete->Peer_Address[2],
                      p_enhanced_conn_complete->Peer_Address[1],
                      p_enhanced_conn_complete->Peer_Address[0]);
          LOG_INFO_APP("     - Connection Interval:   %d.%02d ms\n     - Connection latency:    %d\n     - Supervision Timeout:   %d ms\n     - Status:               0x%02X\n",
                      conn_interval_us / 1000,
                      (conn_interval_us%1000) / 10,
                      p_enhanced_conn_complete->Conn_Latency,
                      p_enhanced_conn_complete->Supervision_Timeout * 10,
                      p_enhanced_conn_complete->Status
                     );
          UNUSED(conn_interval_us);

          if (bleAppContext.Device_Connection_Status == APP_BLE_LP_CONNECTING)
          {
            /* Connection as client */
            bleAppContext.Device_Connection_Status = APP_BLE_CONNECTED_CLIENT;
          }
          else
          {
            /* Connection as server */
            bleAppContext.Device_Connection_Status = APP_BLE_CONNECTED_SERVER;
          }
          bleAppContext.connectionHandle = p_enhanced_conn_complete->Connection_Handle;

          /* USER CODE BEGIN HCI_EVT_LE_ENHANCED_CONN_COMPLETE */

          GATT_CLIENT_APP_ConnHandle_Notif_evt_t notif;
          notif.ConnOpcode = PEER_CONN_HANDLE_EVT;
          notif.ConnHdl = bleAppContext.connectionHandle;
          GATT_CLIENT_APP_Notification(&notif);

          UTIL_SEQ_SetTask( 1U << CFG_TASK_CONN_SETUP, CFG_SEQ_PRIO_0);

          bleAppContext.deviceServerBdAddrType = p_enhanced_conn_complete->Peer_Address_Type;
          memcpy(bleAppContext.a_deviceServerBdAddr, p_enhanced_conn_complete->Peer_Address, BD_ADDR_SIZE);

          /* USER CODE END HCI_EVT_LE_ENHANCED_CONN_COMPLETE */
          break; /* HCI_LE_ENHANCED_CONNECTION_COMPLETE_SUBEVT_CODE */
        }
        case HCI_LE_READ_REMOTE_FEATURES_PAGE_0_COMPLETE_SUBEVT_CODE:
        {
          hci_le_read_remote_features_page_0_complete_event_rp0 *p_read_remote_features_complete;
          p_read_remote_features_complete = (hci_le_read_remote_features_page_0_complete_event_rp0 *) p_meta_evt->data;
          (void)p_read_remote_features_complete;

          LOG_DEBUG_APP("LE_Features: ");
          for(int i = 0; i < 8; i++)
            LOG_DEBUG_APP("0x%02X ", p_read_remote_features_complete->LE_Features[i]);
          LOG_DEBUG_APP("\n");

          UTIL_SEQ_SetEvt(1 << CFG_EVENT_READ_REMOTE_FEATURES_COMPLETE);
        }
        break;
        case HCI_LE_PERIODIC_ADVERTISING_SUBEVENT_DATA_REQUEST_SUBEVT_CODE:
        {
          hci_le_periodic_advertising_subevent_data_request_event_rp0 *p_periodic_adv_subevent_data_req;
          p_periodic_adv_subevent_data_req = (hci_le_periodic_advertising_subevent_data_request_event_rp0 *) p_meta_evt->data;

          //LOG_DEBUG_APP("PADV_DATA_REQUEST %d %d\n", p_periodic_adv_subevent_data_req->Subevent_Start, p_periodic_adv_subevent_data_req->Subevent_Data_Count);

          for(int i = p_periodic_adv_subevent_data_req->Subevent_Start; i < p_periodic_adv_subevent_data_req->Subevent_Start + p_periodic_adv_subevent_data_req->Subevent_Data_Count; i++)
          {
            ESL_AP_SubeventDataRequest(i % PAWR_NUM_SUBEVENTS);
          }

