STMicroelectronics/STM32CubeWBA/Projects/NUCLEO-WBA25CE/Applications/BLE/BLE_ESL_AP/STM32_WPAN/App/app_ble.c
          ret = aci_gap_numeric_comparison_value_confirm_yesno(bleAppContext.connectionHandle, confirm_value);
          if (ret != BLE_STATUS_SUCCESS)
          {
            LOG_INFO_APP("==>> aci_gap_numeric_comparison_value_confirm_yesno : Fail, reason: 0x%02X\n", ret);
          }
          else
          {
            LOG_INFO_APP("==>> aci_gap_numeric_comparison_value_confirm_yesno : Success\n");
          }
          /* USER CODE BEGIN ACI_GAP_NUMERIC_COMPARISON_VALUE_VSEVT_CODE */

          /* USER CODE END ACI_GAP_NUMERIC_COMPARISON_VALUE_VSEVT_CODE */
          break;
        }
        case ACI_GAP_PAIRING_COMPLETE_VSEVT_CODE:
        {
          LOG_INFO_APP(">>== ACI_GAP_PAIRING_COMPLETE_VSEVT_CODE\n");
          aci_gap_pairing_complete_event_rp0 *p_pairing_complete;
          p_pairing_complete = (aci_gap_pairing_complete_event_rp0*)p_blecore_evt->data;

          if (p_pairing_complete->Status != 0)
          {
            LOG_INFO_APP("     - Pairing KO\n     - Status: 0x%02X\n     - Reason: 0x%02X\n",
                         p_pairing_complete->Status, p_pairing_complete->Reason);
          }
          else
          {
            LOG_INFO_APP("     - Pairing Success\n");
          }
          LOG_INFO_APP("\n");

          /* USER CODE BEGIN ACI_GAP_PAIRING_COMPLETE_VSEVT_CODE */

          /* If the AP establish a bond with an ESL and ESL is on Configuring state,
             the AP can configure ESL by writing some ESL Service characteristics  */
          if (p_pairing_complete->Status == SMP_PAIRING_STATUS_SUCCESS)
          {
            ESL_AP_ESLConnected(bleAppContext.connectionHandle, bleAppContext.deviceServerBdAddrType, bleAppContext.a_deviceServerBdAddr);
          }
          else if (p_pairing_complete->Status == SMP_PAIRING_STATUS_ENCRYPT_FAILED) //TODO: check if this is ok
          {
            esl_info_t esl_info;
            NVMDB_HandleType esl_db_h;
            NVMDB_status_t status;

            LOG_ERROR_APP("Pairing failed for key missing on peer device\n");

            status = ESL_AP_GetESLInfoByBDAddress(bleAppContext.deviceServerBdAddrType, bleAppContext.a_deviceServerBdAddr, &esl_info, &esl_db_h);
            if(status == 0)
            {
              /* ESL is configured. Remove from list. */
              LOG_ERROR_APP("Remove device from NVM list\n");
              NVMDB_DeleteRecord(&esl_db_h);
            }
            if(status ==0 || status == 1)
            {
              LOG_ERROR_APP("Remove bond\n");
              aci_gap_remove_bonded_device(bleAppContext.deviceServerBdAddrType, bleAppContext.a_deviceServerBdAddr); //TODO: check if address is not an identity address
            }
          }

          if (p_pairing_complete->Status != SMP_PAIRING_STATUS_SUCCESS)
          {
            aci_gap_terminate(bleAppContext.connectionHandle, HCI_REMOTE_USER_TERMINATED_CONNECTION_ERR_CODE);
          }
          /* USER CODE END ACI_GAP_PAIRING_COMPLETE_VSEVT_CODE */
          break;
        }
        case ACI_GATT_INDICATION_VSEVT_CODE:
        {
          aci_gatt_indication_event_rp0 *p_gatt_indication_event;
          LOG_INFO_APP(">>== ACI_GATT_INDICATION_VSEVT_CODE\n");

          p_gatt_indication_event = (aci_gatt_indication_event_rp0*)p_blecore_evt->data;

          /* USER CODE BEGIN ACI_GATT_INDICATION_VSEVT_CODE_0 */

          /* USER CODE END ACI_GATT_INDICATION_VSEVT_CODE_0 */

          ret = aci_gatt_confirm_indication(p_gatt_indication_event->Connection_Handle);
          if (ret != BLE_STATUS_SUCCESS)
          {
            LOG_INFO_APP("  Fail   : aci_gatt_confirm_indication command, result: 0x%02X\n", ret);
          }
          else
          {
            LOG_INFO_APP("  Success: aci_gatt_confirm_indication command\n");
          }
          /* USER CODE BEGIN ACI_GATT_INDICATION_VSEVT_CODE_1 */

          /* USER CODE END ACI_GATT_INDICATION_VSEVT_CODE_1 */
          break;
        }
        case ACI_WARNING_VSEVT_CODE:
        {
          aci_warning_event_rp0 *p_fw_warning_event;

          p_fw_warning_event = (aci_warning_event_rp0 *)p_blecore_evt->data;
          UNUSED(p_fw_warning_event);
          LOG_INFO_APP(">>== ACI_WARNING_VSEVT_CODE\n");
          LOG_INFO_APP("FW warning Type = 0x%02X\n", p_fw_warning_event->Warning_Type);
          /* USER CODE BEGIN ACI_HAL_FW_ERROR_VSEVT_CODE */
          HAL_Delay(100);
          NVIC_SystemReset();
          /* USER CODE END ACI_HAL_FW_ERROR_VSEVT_CODE */
          break;
        }
        /* USER CODE BEGIN ECODE_1 */

        case ACI_L2CAP_COC_CONNECT_CONFIRM_VSEVT_CODE:
        {
          LOG_INFO_APP(">>== ACI_L2CAP_COC_CONNECT_CONFIRM_VSEVT_CODE\n");
          aci_l2cap_coc_connect_confirm_event_rp0 *p_event;
          p_event = (aci_l2cap_coc_connect_confirm_event_rp0 *) p_blecore_evt->data;

          LOG_DEBUG_APP("MTU: %d\nMPS: %d\nResult: %d\nChannel number: %d\n",
                      p_event->MTU,
                      p_event->MPS,
                      p_event->Result,
                      p_event->Channel_Number);

          OTP_CLIENT_L2CAPConnectionResp(p_event);
        }
        break;
        case ACI_L2CAP_COC_TX_POOL_AVAILABLE_VSEVT_CODE:
        {
          LOG_DEBUG_APP(">>== ACI_L2CAP_COC_TX_POOL_AVAILABLE_VSEVT_CODE\n");
          OTP_CLIENT_L2CAPTxComplete();
        }
        break;
        case ACI_L2CAP_COC_DISCONNECT_VSEVT_CODE:
        {
          LOG_INFO_APP(">>== ACI_L2CAP_COC_DISCONNECT_VSEVT_CODE\n");
          OTP_CLIENT_L2CAPDisconnectionComplete();
        }
        break;
        case ACI_L2CAP_COMMAND_REJECT_VSEVT_CODE:
        {
          LOG_INFO_APP(">>== ACI_L2CAP_COMMAND_REJECT_VSEVT_CODE\n");
          aci_l2cap_command_reject_event_rp0 *p_event;
          p_event = (aci_l2cap_command_reject_event_rp0 *) p_blecore_evt->data;

          LOG_ERROR_APP("Reason: 0x%04X\n", p_event->Reason);
          if(p_event->Data_Length > 0)
          {
            LOG_ERROR_APP("Reason Data:");
            for(int i = 0;  i < p_event->Data_Length; i++)
            {
              LOG_ERROR_APP("%02X ", p_event->Data[i]);
            }
            LOG_ERROR_APP("\n");
          }
        }
        break;
      case ACI_L2CAP_COC_FLOW_CONTROL_VSEVT_CODE:
        {
          LOG_DEBUG_APP(">>== ACI_L2CAP_COC_FLOW_CONTROL_VSEVT_CODE\n");
          aci_l2cap_coc_flow_control_event_rp0 *p_event;
          p_event = (aci_l2cap_coc_flow_control_event_rp0 *) p_blecore_evt->data;

