STMicroelectronics/STM32CubeWBA/Projects/NUCLEO-WBA25CE/Applications/BLE/BLE_ESL_AP/STM32_WPAN/App/app_ble.c
  status = aci_gap_adv_set_periodic_parameters(0, /* Advertising_Handle */
                                               (PAWR_INTERVAL_MS*100)/125, /* Periodic_Adv_Interval_Min */
                                               (PAWR_INTERVAL_MS*100)/125, /* Periodic_Adv_Interval_Max */
                                               0, /* Periodic_Adv_Properties */
                                               PAWR_NUM_SUBEVENTS, /* Num_Subevents */
                                               (PAWR_SUBEVENT_INTERVAL_MS*100)/125, /* Subevent_Interval */
                                               (PAWR_RESPONSE_SLOT_DELAY_MS*100)/125, /* Response_Slot_Delay */
                                               PAWR_RESPONSE_SLOT_SPACING_US/125, /* Response_Slot_Spacing */
                                               PAWR_NUM_RESPONSE_SLOTS /* Num_Response_Slots */);
  if (status != BLE_STATUS_SUCCESS)
  {
    LOG_ERROR_APP("==>> aci_gap_adv_set_periodic_parameters - fail, result: 0x%02X\n", status);
  }
  else
  {
    LOG_DEBUG_APP("==>> Success: aci_gap_adv_set_periodic_parameters\n");
  }

  status = aci_gap_adv_set_periodic_enable(1, 0);
  if (status != BLE_STATUS_SUCCESS)
  {
    LOG_ERROR_APP("==>> aci_gap_adv_set_periodic_enable - fail, result: 0x%02X\n", status);
  }
  else
  {
    LOG_DEBUG_APP("==>> Success: aci_gap_adv_set_periodic_enable\n");
  }

  advertising_set_parameters.Advertising_Handle = 0;
  advertising_set_parameters.Duration = 0;
  advertising_set_parameters.Max_Extended_Advertising_Events = 0;

  status = aci_gap_adv_set_enable(1, 1, &advertising_set_parameters);
  if (status != BLE_STATUS_SUCCESS)
  {
    LOG_ERROR_APP("==>> hci_le_set_extended_advertising_enable - fail, result: 0x%02X\n", status);
  }
  else
  {
    LOG_DEBUG_APP("==>> Success: hci_le_set_extended_advertising_enable\n");
  }

  HAL_Delay(1000);

  status = aci_gap_adv_set_enable(0, 1, &advertising_set_parameters);

  if (status != BLE_STATUS_SUCCESS)
  {
    LOG_ERROR_APP("==>> Stop ext adv - fail, result: 0x%02X\n", status);
  }
}

static void start_general_connection(void)
{
  tBleStatus status;

  bGeneralConn = true;

  status = aci_gap_start_general_connection_establish_proc(HCI_SCAN_TYPE_PASSIVE, /* LE_Scan_Type */
                                                           SCAN_INT_MS(500), /* LE_Scan_Interval */
                                                           SCAN_WIN_MS(500), /* LE_Scan_Window */
                                                           CFG_BD_ADDRESS_TYPE, /* Own_Address_Type */
                                                           HCI_SCAN_FILTER_NO, /* Scanning_Filter_Policy */
                                                           1 /* Filter_Duplicates */);
  if (status != BLE_STATUS_SUCCESS)
  {
    LOG_ERROR_APP("aci_gap_start_general_connection_establish_proc - fail, result: 0x%02X\n", status);
    bleAppContext.Device_Connection_Status = APP_BLE_IDLE;
    Error_Handler();
  }
  else
  {
    LOG_DEBUG_APP("==>> aci_gap_start_general_connection_establish_proc - Success\n");
    bleAppContext.Device_Connection_Status = APP_BLE_LP_CONNECTING;
  }
}

void periodic_sync_info_transfer(void)
{
  tBleStatus status;

  status = hci_le_periodic_advertising_set_info_transfer(bleAppContext.connectionHandle, 0, 0);
  if (status != BLE_STATUS_SUCCESS)
  {
    LOG_ERROR_APP("hci_le_periodic_advertising_set_info_transfer - fail, result: 0x%02X, conn handle: 0x%04X\n", status, bleAppContext.connectionHandle);
    return;
  }
  else
  {
    LOG_DEBUG_APP("==>> hci_le_periodic_advertising_set_info_transfer - Success\n");
  }
}

void connection_setup(void)
{
   tBleStatus ret;

   UTIL_SEQ_ClrEvt(1 << CFG_EVENT_READ_REMOTE_FEATURES_COMPLETE);
   ret = hci_le_read_remote_features_page_0(bleAppContext.connectionHandle);
   LOG_DEBUG_APP("hci_le_read_remote_features - result: 0x%02X\n", ret);
   if(ret != BLE_STATUS_SUCCESS)
   {
     APP_BLE_Procedure_Gap_General(PROC_GAP_GEN_CONN_TERMINATE);

     return;
   }

   UTIL_SEQ_WaitEvt(1 << CFG_EVENT_READ_REMOTE_FEATURES_COMPLETE);
   //TODO: check if remote device has wanted feature

   ret = aci_gap_send_pairing_req(bleAppContext.connectionHandle, 0);
   if (ret != BLE_STATUS_SUCCESS)
   {
     LOG_ERROR_APP("Pairing request cmd failure: 0x%02X\n", ret);
   }
   else
   {
     LOG_DEBUG_APP("Pairing request cmd success\n");

   }
}

void create_periodic_advertising_connection(uint8_t subevent, uint8_t Peer_Address_Type, uint8_t Peer_Address[6])
{
  tBleStatus ble_status;
  Init_Param_Phy_t init_param_phy;

  aci_gap_terminate_gap_proc(GAP_GENERAL_CONNECTION_ESTABLISHMENT_PROC);
  gap_cmd_resp_wait();
  bGeneralConn = false;

  init_param_phy.Scan_Interval = SCAN_INT_MS(SCAN_INTERVAL_MS); /* Ignored */
  init_param_phy.Scan_Window = SCAN_WIN_MS(SCAN_WINDOW_MS); /* Ignored */
  init_param_phy.Conn_Interval_Min = CONN_INT_MS(CONNECTION_INTERVAL_MS);
  init_param_phy.Conn_Interval_Max = CONN_INT_MS(CONNECTION_INTERVAL_MS);
  init_param_phy.Conn_Latency = 0;
  init_param_phy.Supervision_Timeout = CONN_SUP_TIMEOUT_MS(SUPERVISION_TIMEOUT_MS);
  init_param_phy.Min_CE_Length = 2;
  init_param_phy.Max_CE_Length = 2;

  LOG_DEBUG_APP("!!!!! create_periodic_advertising_connection \n Peer_Address @:%02x:%02x:%02x:%02x:%02x:%02x\n",
              Peer_Address[5],
              Peer_Address[4],
              Peer_Address[3],
              Peer_Address[2],
              Peer_Address[1],
              Peer_Address[0]);
  LOG_DEBUG_APP("      Connection Interval:   %d ms\n  - Supervision Timeout: %d ms\n",
              CONNECTION_INTERVAL_MS,
              SUPERVISION_TIMEOUT_MS);

  ble_status = aci_gap_ext_create_connection(0, /* Initiating_Mode */
                                             GAP_DIRECT_CONNECTION_ESTABLISHMENT_PROC, /* Procedure */
                                             CFG_BD_ADDRESS_TYPE, /* Own_Address_Type */
                                             Peer_Address_Type, /* Peer_Address_Type */
                                             Peer_Address, /* Peer_Address */
                                             0, /* Advertising_Handle */
                                             subevent, /* Subevent */
                                             HCI_INIT_FILTER_NO, /* Initiator_Filter_Policy, ignored */
                                             HCI_INIT_PHYS_SCAN_CONN_LE_1M,
                                             &init_param_phy);
  if (ble_status != BLE_STATUS_SUCCESS)
  {
    LOG_ERROR_APP("aci_gap_ext_create_connection - fail, result: 0x%02X\n", ble_status);
    return;
  }
  else
  {
    LOG_DEBUG_APP("==>> aci_gap_ext_create_connection - Success\n");
  }
  bleAppContext.Device_Connection_Status = APP_BLE_LP_CONNECTING;
}

static uint8_t analyse_adv_report(uint8_t adv_data_size, const uint8_t *p_adv_data,
                                  uint8_t address_type, const uint8_t *p_address)
{
  uint8_t found_status = 0;
  uint16_t i = 0;
  uint8_t ad_length, ad_type;

  if (bGeneralConn)
  {
    esl_info_t esl_info;
    NVMDB_HandleType db_h;

    if(ESL_AP_GetESLInfoByBDAddress(address_type, p_address, &esl_info, &db_h) == 0)
    {
      /* Found associated ESL advertising. Connect. */
      LOG_DEBUG_APP("Configured ESL found: %02x:%02x:%02x:%02x:%02x:%02x\n",p_address[5],p_address[4],p_address[3],p_address[2],p_address[1],p_address[0]);
      ESL_AP_Reconnect(address_type, p_address);
    }
  }
  else
  {
    while(i < adv_data_size)
    {
      ad_length = p_adv_data[i];
      ad_type = p_adv_data[i + 1];

      switch (ad_type)
      {

