STMicroelectronics/STM32CubeWBA/Projects/NUCLEO-WBA25CE/Applications/BLE/BLE_ESL_AP/STM32_WPAN/App/app_ble.c
      case AD_TYPE_16_BIT_SERV_UUID_CMPLT_LIST:
      case AD_TYPE_16_BIT_SERV_UUID:
        for(int j=i+2; j<i+ad_length; j++)
        {
          if ((p_adv_data[j] == 0x57) && (p_adv_data[j+1] == 0x18))
          {
            LOG_INFO_APP("+SCAN: %d,%02X%02X%02X%02X%02X%02X\n",
                        address_type,
                        p_address[5],
                        p_address[4],
                        p_address[3],
                        p_address[2],
                        p_address[1],
                        p_address[0]);
            found_status = 1;
            break;
          }
        }
        break;
      default:
        break;
      }/* end of switch*/

      i += ad_length + 1; /* increment the iterator to go on next element*/

      if (found_status != 0)
      {
        break;
      }
    }/* end of while*/
  }
  return found_status;
}

static void Connect_Request(void)
{
  tBleStatus result;

  aci_gap_terminate_gap_proc(GAP_GENERAL_CONNECTION_ESTABLISHMENT_PROC);

  bGeneralConn = false;

  result = aci_gap_create_connection(SCAN_INT_MS(500), /* LE_Scan_Interval */
                                     SCAN_WIN_MS(500), /* LE_Scan_Window */
                                     bleAppContext.deviceServerBdAddrType,
                                     &bleAppContext.a_deviceServerBdAddr[0],
                                     CFG_BD_ADDRESS_TYPE, /* Own_Address_Type */
                                     CONN_INT_MS(CONNECTION_INTERVAL_MS),
                                     CONN_INT_MS(CONNECTION_INTERVAL_MS),
                                     0, /* Conn_Latency */
                                     CONN_SUP_TIMEOUT_MS(SUPERVISION_TIMEOUT_MS),
                                     2,
                                     2);
  if (result == BLE_STATUS_SUCCESS)
  {
    bleAppContext.Device_Connection_Status = APP_BLE_LP_CONNECTING;
    LOG_DEBUG_APP("==>> GAP Create connection Success\n");
  }
  else
  {
    LOG_ERROR_APP("==>> GAP Create connection Failed, result: 0x%02x\n", result);
  }
  return;
}

uint8_t  Scan_proc(void)
{
  uint8_t status;
  uint32_t paramA, paramB, paramC;

  paramA = SCAN_INT_MS(500);
  paramB = SCAN_WIN_MS(500);
  paramC = APP_BLE_SCANNING;
  if (bleAppContext.Device_Connection_Status != APP_BLE_CONNECTED_CLIENT)
  {
    aci_gap_terminate_gap_proc(GAP_GENERAL_CONNECTION_ESTABLISHMENT_PROC);
    bGeneralConn = false;

    status = aci_gap_start_general_discovery_proc(paramA,
                                                  paramB,
                                                  CFG_BD_ADDRESS_DEVICE, /* Own_Address_Type */
                                                  1 /* Filter_Duplicates */);
    if (status != BLE_STATUS_SUCCESS)
    {
      LOG_ERROR_APP("aci_gap_start_general_discovery_proc - fail, result: 0x%02X\n", status);
      return status;
    }
    else
    {
      bleAppContext.Device_Connection_Status = (APP_BLE_ConnStatus_t)paramC;
      LOG_DEBUG_APP("==>> aci_gap_start_general_discovery_proc - Success\n");
    }
  }
  else
  {
    status = BLE_STATUS_FAILED;   //TBR??? Check if it is correct error return value
  }
  return status;
}

void set_bleAppContext_address(uint8_t address_type, const uint8_t p_address[6])
{
  bleAppContext.deviceServerBdAddrType = address_type;
  memcpy(bleAppContext.a_deviceServerBdAddr, p_address, BD_ADDR_SIZE);
}

uint8_t* get_bleAppContext_address(void)
{
  return(bleAppContext.a_deviceServerBdAddr);
}

/* USER CODE END FD_LOCAL_FUNCTION */

/*************************************************************
 *
 * WRAP FUNCTIONS
 *
 *************************************************************/

/**
  * @brief Callback called by the BLE stack (from BleStack_Process() context)
  * to send an indication to the application. The indication is a BLE standard
  * packet that can be either an ACI/HCI event or an ACL data.
  * @param data: pointer to the data of the packet
  * @param length: length of the data of the packet
  * @param ext_data: pointer to the extended data
  * @param ext_length: extended data length
  * @retval Status of the operation
  */

tBleStatus BLECB_Indication( const uint8_t* data,
                          uint16_t length,
                          const uint8_t* ext_data,
                          uint16_t ext_length )
{
  uint8_t status = BLE_STATUS_FAILED;
  BleEvtPacket_t *phcievt = NULL;
  uint16_t total_length = (length+ext_length);

  UNUSED(ext_data);

  /* USER CODE BEGIN BLECB_Indication */

  /* USER CODE END BLECB_Indication */

  if (data[0] == HCI_EVENT_PKT_TYPE)
  {
    BLE_EVENTS_ResumeFlowProcessCb.Callback = BLE_ResumeFlowProcessCallback;
    if (AMM_Alloc (CFG_AMM_VIRTUAL_BLE_EVENTS,
                   DIVC((sizeof(BleEvtPacketHeader_t) + total_length), sizeof (uint32_t)),
                   (uint32_t **)&phcievt,
                   &BLE_EVENTS_ResumeFlowProcessCb) != AMM_ERROR_OK)
    {
      LOG_INFO_APP("Alloc failed\n");
      status = BLE_STATUS_FAILED;
    }
    else if (phcievt != (BleEvtPacket_t *)0 )
    {
      phcievt->evtserial.type = HCI_EVENT_PKT_TYPE;
      phcievt->evtserial.evt.evtcode = data[1];
      phcievt->evtserial.evt.plen  = data[2];
      MEMCPY( (void*)&phcievt->evtserial.evt.payload, &data[3], data[2]);
      LST_insert_tail(&BleAsynchEventQueue, (tListNode *)phcievt);
      UTIL_SEQ_SetTask(1U << CFG_TASK_HCI_ASYNCH_EVT_ID, CFG_SEQ_PRIO_0);
      status = BLE_STATUS_SUCCESS;
    }
  }
  else if (data[0] == HCI_ACLDATA_PKT_TYPE)
  {
    status = BLE_STATUS_SUCCESS;
  }
  return status;
}

/* USER CODE BEGIN FD_WRAP_FUNCTIONS */

void UART_CMD_ProcessRequestCB(void)
{
  UTIL_SEQ_SetTask(1u << CFG_TASK_UART_CMD_PROCESS, CFG_SEQ_PRIO_0);
}

/* USER CODE END FD_WRAP_FUNCTIONS */
